In [1]:
from key.login import serverKey
from com.Dbsys import DBsysyem
import matplotlib.pyplot as plt
import pandas as pd
plt.style.use('seaborn')

In [2]:
key = serverKey('fever')
system = DBsysyem(db_name='fevercoach_share',login=key.login)
comd = 'select * from fever'
fever = system.run(comd)

In [4]:
fever

,baby_id,app_code,type,data1,data2,data3,data4,memo,date
0,11724,100,1,38.2,C,,0,,2015-09-23 22:40:00\r
1,11724,100,1,38.5,C,,0,,2015-09-23 23:41:00\r
2,11724,100,1,37.8,C,,0,,2015-09-24 01:52:00\r
3,11724,100,1,37.4,C,,0,,2015-09-24 02:59:00\r
4,11724,100,1,37.3,C,,0,,2015-09-24 06:07:00\r
...,...,...,...,...,...,...,...,...,...
25136973,713667,100,1,37.2,,,0,,2019-02-26 22:06:00\r
25136974,713667,100,1,37.4,,,0,,2019-02-26 20:35:00\r
25136975,713667,100,1,36.9,,,0,,2019-02-26 11:13:00\r
25136976,718985,100,1,38.2,C,,0,,2019-10-16 21:15:22\r
25136977,551099,100,1,38.4,C,,0,,2019-02-28 21:12:50\r

In [ ]:
key = serverKey('mimic_pk')
system = DBsysyem(db_name='mimiciv_processed', login=key.login)

comd2 = 'select * from enzyme'

df = system.run(comd2)

In [ ]:
df

In [ ]:
df.ck_cpk.isnull().sum()

In [ ]:
df.describe().T.astype('int')

In [ ]:
df2 = system.run('select * from antibiotics_list_by_ndc')

In [ ]:
df.info()